InformationRegisters/КанбанРазрешенныеПереходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанРазрешенныеПереходы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаголовокДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПриПопадании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйПереход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйУход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДоски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>0 без разделителей, 1 Проект, 2 Сотрудник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКартинкиКорзины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДорожки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДорожки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Общая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омКанбанДоскиНаСервереПовтор/Ext/Module.bsl
Функция ПолучитьРазрешенныеПереходы(УИДДоски) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанбанРазрешенныеПереходы.УИДКуда КАК УИДКуда,
	|	КанбанРазрешенныеПереходы.УИДОткуда КАК УИДОткуда,
	|	КанбанРазрешенныеПереходы.ЗаголовокДаты КАК ЗаголовокДаты,
	|	КанбанРазрешенныеПереходы.ЗаголовокКомментария КАК ЗаголовокКомментария,
	|	КанбанРазрешенныеПереходы.ТребуетсяДата КАК ТребуетсяДата,
	|	КанбанРазрешенныеПереходы.ТребуетсяКомментарий КАК ТребуетсяКомментарий
	|ИЗ
	|	РегистрСведений.КанбанРазрешенныеПереходы КАК КанбанРазрешенныеПереходы
	|ГДЕ
	|	КанбанРазрешенныеПереходы.Доска = &УИДДоски";
	
	Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ПолучитьРазрешенныеПереходы()

Функция ПолучитьУИДКолонки(УИДДоски = "", ИмяКолонки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Если ИмяКолонки = "_Возврат_ТЗ" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиДляВозвратаТЗ();
	ИначеЕсли ИмяКолонки = "_Ожидание_ТЗ" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиДляОжиданияТЗ();
	ИначеЕсли ИмяКолонки = "_Ожидание_Производства" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиОжиданиеПроизводства();
		Если ПустаяСтрока(УИДДоски) Тогда
			УИДДоски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "_Приостановка_Производства" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиПриостановкаПроизводства();
	Иначе
		НастройкаИмя = ИмяКолонки;
	КонецЕсли;
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(НастройкиПроекта.Значение КАК СТРОКА(200)) КАК Значение
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КанбанКолонки.УИД КАК УИД
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
	|		ПО вт.Значение = КанбанКолонки.Наименование
	|ГДЕ
	|	КанбанКолонки.Доска = &УИДДоски";
	
	Запрос.УстановитьПараметр("ИмяНастройки", 	НастройкаИмя);
	Запрос.УстановитьПараметр("УИДДоски", 		УИДДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.УИД; 
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьУИДКолонки()

Функция ПолучитьИмяДоски(ИмяДоски) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Если ИмяДоски = "НаименованиеДоскиДляТЗ" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляТЗ();
	ИначеЕсли ИмяДоски = "НаименованиеДоскиПроизводство" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляПроизводства();
	Иначе
		Возврат "";
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", НастройкаИмяДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Значение; 
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьУИДДоски()

Функция ПолучитьУИДДоски(ИмяДоски) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Если ИмяДоски = "УИДДоскиДляТЗ" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляТЗ();
	ИначеЕсли ИмяДоски = "УИДДоскиПроизводство" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляПроизводства();
	Иначе	
		Возврат "";
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанбанДоски.УИД КАК УИД
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДоски КАК КанбанДоски
	|		ПО ((ВЫРАЗИТЬ(НастройкиПроекта.Значение КАК СТРОКА(200))) = КанбанДоски.Наименование)
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", НастройкаИмяДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.УИД; 
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьУИДДоски()

Функция ПолучитьУИДДорожки(УИДДоски, ИмяДорожки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Если ИмяДорожки = "" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИНИМУМ(КанбанДорожки.НомерПоПорядку) КАК НомерПоПорядку,
			|	КанбанДорожки.Доска КАК Доска
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.КанбанДорожки КАК КанбанДорожки
			|ГДЕ
			|	КанбанДорожки.Доска = &УИДДоски
			|
			|СГРУППИРОВАТЬ ПО
			|	КанбанДорожки.Доска
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КанбанДорожки.УИД КАК УИД
			|ИЗ
			|	вт КАК вт
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДорожки КАК КанбанДорожки
			|		ПО вт.НомерПоПорядку = КанбанДорожки.НомерПоПорядку
			|			И вт.Доска = КанбанДорожки.Доска";
		
		Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.УИД;
		КонецЦикла;
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КанбанДорожки.УИД КАК УИД
			|ИЗ
			|	РегистрСведений.КанбанДорожки КАК КанбанДорожки
			|ГДЕ
			|	КанбанДорожки.Доска = &УИДДоски
			|	И КанбанДорожки.Наименование = &ИмяДорожки";
		
		Запрос.УстановитьПараметр("ИмяДорожки", ИмяДорожки);

	КонецЕсли;	
	
	Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.УИД;
	КонецЦикла;
		
	Возврат "";
	
КонецФункции // ПолучитьУИДДорожки()

Функция ПолучитьУИДКолонокДоски(УИДДоски, ДобавитьСлужебныеКолонки = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", УИДДоски);
	
	МассивУИДов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УИД");
	
	Если ДобавитьСлужебныеКолонки Тогда
		Для каждого х Из ПолучитьМассивСлужебныхКолонок() Цикл
			МассивУИДов.Добавить(х);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивУИДов;
	
КонецФункции // ПолучитьКолонкиДоски() 

Функция ПолучитьМассивСлужебныхКолонок() Экспорт
	
	МассивУИДов = Новый Массив(3);
	МассивУИДов[0] = "1";		//выполнена
	МассивУИДов[1] = "100";     //корзина
	МассивУИДов[2] = "200";     //стоп
	
	Возврат МассивУИДов;

КонецФункции // ПолучитьМассивСлужебныхКолонок()

Функция ПолучитьСписокСлужебныхКолонок() Экспорт
	
	СписокСлужебных = Новый СписокЗначений;
	СписокСлужебных.Добавить("1", 	"Выполнена");
	СписокСлужебных.Добавить("100", "В корзине");
	СписокСлужебных.Добавить("200", "На стопе");
	
	Возврат СписокСлужебных;
	
КонецФункции // ПолучитьМассивСлужебныхКолонок()
